testCases/Attic/T3B/gammaSST/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (9.4 0 0);

boundaryField
{
	wall
    {
        type            fixedValue;
		value     uniform (0 0 0);
    }
    firstBottomFace
    {
        type            slip;
    }
    firstTopFace
    {
        type            slip;
    }
    secondTopFace
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (9.4 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }	
}


// ************************************************************************* //
